/*
Задача 54: Задайте двумерный массив. 
Напишите программу, которая упорядочит по убыванию элементы каждой строки двумерного массива.
Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4
В итоге получается вот такой массив:
7 4 2 1
9 5 3 2
8 4 4 2

Заготовка для семинара

*/

var random = new Random();
int rows = random.Next(4, 8);
int columns = random.Next(4, 8);
int[,] numbers = new int[rows, columns];

Console.WriteLine();
Console.WriteLine($"массив: {rows} x {columns}");
Console.WriteLine();

FillArray(numbers);
Console.WriteLine();
PrintArray(numbers);
Console.WriteLine();


void FillArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = new Random().Next(1, 10);
        }
    }
}

void PrintArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write(array[i, j] + "\t");
        }
        Console.WriteLine();
    }
    Console.WriteLine("----");
}

